'''
Даны два комплексных числа. Напишите программу, которая вычисляет и выводит их сумму, разность и произведение.
'''
z1, z2 = complex(input()), complex(input())
print(f'{z1} + {z2} =', z1 + z2)
print(f'{z1} - {z2} =', z1 - z2)
print(f'{z1} * {z2} =', z1 * z2)